# Notebook 2:
## In this Notebook we will work on cast.csv dataset and implement some basic python program

Convert a number to different bases:

In [18]:
def decimal_to_binary(x): 
    ans = bin(int(x)) 
    return ans
    
def decimal_to_octal(x): 
    ans = oct(int(x)) 
    return ans

def decimal_to_hexadecimal(x): 
    ans = hex(int(x)) 
    return ans

x = input("Enter a number:")
print("The binary representation of the number is: ",decimal_to_binary(x))
print("The octal representation of the number is: ",decimal_to_octal(x))
print("The hexadecimal representation of the number is: ",decimal_to_hexadecimal(x))

Enter a number:20
The binary representation of the number is:  0b10100
The octal representation of the number is:  0o24
The hexadecimal representation of the number is:  0x14


## import cast.csv

In [19]:
import pandas as pd
cast = pd.read_csv('data/cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

## Q1:

In [20]:
Hamlet_filt = cast['title'] == 'Hamlet' # This filter find only Hamlet movie.
Hamlet_drop =  cast[Hamlet_filt].drop_duplicates(subset = 'year', keep = 'first') # We need to find movies and not roles so we need to drop duplicates
Hamlet_count = Hamlet_drop['title'].count()
print("Ther are:", Hamlet_count ,"movies that have the title Hamlet." )

Ther are: 17 movies that have the title Hamlet.

## Q2: 
### list of "Treasure Island" movies from earliest to most recent.

In [21]:
filt = cast['title'] == 'Treasure Island' # This filter find only Treasure Island movie.
Treasure = cast[filt].drop_duplicates(subset = 'year', keep = 'first').drop(["name", "type", "character", "n"], axis = 1)
Treasure.sort_values(by= 'year')

                  title  year
313097  Treasure Island  1918
345942  Treasure Island  1920
8570    Treasure Island  1934
12141   Treasure Island  1950
38151   Treasure Island  1972
484325  Treasure Island  1973
14899   Treasure Island  1985
104905  Treasure Island  1999

## Q3:

In [33]:
Hamlet = cast[Hamlet_filt] # use Hamlet_filt to find Hamlet movie.
filt_2 = Hamlet['year'] == 1921 # this filter shows movies from 1921
Hamlet21 = Hamlet[filt_2]
Hamlet_roles = Hamlet21['name'].count()
print( Hamlet_roles , "roles were credited in the silent 1921 version of Hamlet" )

9 roles were credited in the silent 1921 version of Hamlet

## Q4:

In [23]:
Hamlet_by_decade =Hamlet_drop.groupby(Hamlet_drop['year']//10*10) # Group by decade
Hamlet_by_decade['title'].count()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    2
Name: title, dtype: int64

## Q5:

In [38]:
n = cast[cast['n']==1]
n50 = n[(n['year'] < 1960) & (n['year'] > 1949)] # filter the 50's
leading_roles = n50.groupby(['type', 'year'])['n'].count() # Make series of 2 series for actress and actors.
print("Number of available leading roles to actor: ")
print(leading_roles['actor'])
print()
print("Number of available leading roles to actresses: ")
print(leading_roles['actress'])

Number of available leading roles to actor:
year
1950    604
1951    633
1952    591
1953    634
1954    626
1955    606
1956    614
1957    708
1958    694
1959    678
Name: n, dtype: int64

Number of available leading roles to actresses:
year
1950    271
1951    272
1952    284
1953    290
1954    298
1955    264
1956    288
1957    284
1958    275
1959    287
Name: n, dtype: int64

## Q6:

In [25]:
n = cast[cast['n']==1] # filter n =1 
n90 = n[(n['year'] > 1989)] # filter from 90's
n90.groupby(['name']).count().sort_values(by= 'n' , ascending= False).head(10)['n']

name
Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Amitabh Bachchan       68
Eric Roberts           68
Nagarjuna Akkineni     60
Dilip                  59
Name: n, dtype: int64

## Q7:

In [34]:
FO = cast[cast['name'] == 'Frank Oz'] # All of Frank movies.
FO_sort = FO.sort_values('year')# Sort by years.
ans = FO_sort.groupby(['year', 'title']).count() 
ans = ans[ans['name']!=1] # filter all the films the Frank played one's.
ans_n = ans.loc[:, ['n']] # Take random colum and all the rows.
ans_rename = ans_n.rename(columns = {'n': 'roles'}, inplace = False) # Change the name of this colum.
ans_rename

                                               roles
year title
1979 The Muppet Movie                              8
1981 An American Werewolf in London                2
     The Great Muppet Caper                        6
1982 The Dark Crystal                              2
1984 The Muppets Take Manhattan                    7
1985 Sesame Street Presents: Follow that Bird      3
1992 The Muppet Christmas Carol                    7
1996 Muppet Treasure Island                        4
1999 Muppets from Space                            4
     The Adventures of Elmo in Grouchland          3